{
    "this": 1788,
    "file": 1095,
    "is": 1270,
    "part": 1526,
    "of": 1467,
    "the": 1774,
    "project": 1561,
    ".": 321,
    "see": 1649,
    "for": 1116,
    "copyright": 948,
    "information": 1250,
    "program": 1560,
    "free": 1127,
    "software": 1685,
    ";": 505,
    "you": 1971,
    "can": 887,
    "it": 1275,
    "and": 785,
    "or": 1489,
    "under": 1846,
    "gnu": 1154,
    "general": 1142,
    "public": 1567,
    "license": 1330,
    "as": 804,
    "by": 868,
    "foundation": 1125,
    "either": 1034,
    "version": 1892,
    ",": 177,
    "(": 0,
    "at": 809,
    "your": 1973,
    "option": 1486,
    ")": 97,
    "any": 790,
    "distributed": 1007,
    "in": 1237,
    "that": 1772,
    "will": 1932,
    "be": 834,
    "but": 866,
    "without": 1942,
    "even": 1063,
    "a": 750,
    "more": 1396,
    "details": 994,
    "should": 1672,
    "have": 1176,
    "copy": 947,
    "with": 1938,
    "if": 1220,
    "not": 1442,
    "write": 1949,
    "to": 1803,
    "inc": 1242,
    "place": 1536,
    "suite": 1738,
    "ma": 1360,
    "usa": 1862,
    ":": 435,
    "support": 1742,
    "game": 1141,
    "include": 1245,
    "h": 1164,
    "{": 1976,
    "=": 602,
    "}": 2016,
    "const": 936,
    "[": 693,
    "]": 720,
    "good": 1156,
    "bool": 850,
    "player": 1537,
    ">": 667,
    "switch": 1743,
    "case": 892,
    "break": 859,
    "else": 1037,
    "entry": 1054,
    "u": 1837,
    "are": 797,
    "expected": 1071,
    "script": 1642,
    "return": 1616,
    "false": 1084,
    "added": 773,
    "would": 1948,
    "go": 1155,
    "then": 1782,
    "base": 831,
    "location": 1346,
    "true": 1822,
    "must": 1401,
    "send": 1657,
    "error": 1060,
    "message": 1382,
    "what": 1918,
    "kind": 1301,
    "on": 1477,
    "std": 1717,
    "list": 1338,
    "<": 568,
    "empty": 1043,
    "begin": 838,
    "end": 1046,
    "struct": 1732,
    "default": 983,
    "void": 1901,
    "override": 1503,
    "time": 1797,
    "new": 1429,
    "name": 1416,
    "this file": 1792,
    "of the": 1470,
    ". see": 411,
    "you can": 1972,
    "under the": 1847,
    "by the": 869,
    "the license": 1778,
    ", or": 281,
    "or (": 1490,
    "version .": 1893,
    ". this": 421,
    "in the": 1241,
    "will be": 1933,
    ", but": 232,
    "for a": 1118,
    "see the": 1650,
    ". you": 429,
    "; if": 540,
    "if not": 1224,
    "to the": 1808,
    ", inc": 253,
    "inc .": 1243,
    ". ,": 333,
    ", ma": 266,
    ": ,": 440,
    ", ,": 190,
    ", .": 200,
    ". h": 381,
    "{ =": 1983,
    "= ,": 609,
    ", =": 213,
    "= }": 666,
    "} ;": 2028,
    "; const": 529,
    "[ ]": 702,
    "] =": 737,
    "= {": 664,
    "{ ,": 1978,
    ") {": 168,
    "( ,": 18,
    ") )": 103,
    ") ;": 124,
    "if (": 1221,
    "] ,": 727,
    "( )": 5,
    ") ,": 112,
    ", )": 181,
    "{ if": 1994,
    "= ;": 618,
    "case :": 894,
    "; break": 523,
    "break ;": 860,
    "; case": 526,
    "; }": 560,
    "} if": 2039,
    "; else": 530,
    "} }": 2044,
    "} return": 2041,
    "false ;": 1087,
    ", }": 319,
    "; return": 549,
    "} else": 2035,
    "else {": 1040,
    "{ this": 2003,
    "this is": 1793,
    "( a": 39,
    ") and": 150,
    "true ;": 1825,
    ") return": 163,
    ") =": 136,
    "= =": 621,
    "= )": 607,
    "std :": 1718,
    ": :": 447,
    "> ;": 676,
    ". )": 327,
    "( .": 24,
    "for (": 1117,
    "> :": 675,
    "= .": 612,
    ". end": 376,
    "{ (": 1977,
    ") >": 140,
    "( (": 1,
    ") :": 121,
    ", (": 178,
    "true )": 1823,
    "; >": 516,
    "; ;": 511,
    ": {": 499,
    "( =": 33,
    "; =": 514,
    "= (": 603,
    ", >": 216,
    "( const": 46,
    "( <": 32,
    "< =": 572,
    "{ return": 2001,
    "new (": 1430,
    "void (": 1902,
    "= new": 648,
    "name =": 1420,
    ", inc .": 254,
    "inc . ,": 1244,
    ": , ,": 441,
    ", , ,": 193,
    ", , .": 194,
    "= , =": 611,
    ", = ,": 214,
    "[ ] =": 708,
    "] = {": 740,
    "{ , ,": 1979,
    ") ) ;": 108,
    ") ; if": 130,
    "; if (": 541,
    "( ) ,": 8,
    ") , ,": 115,
    ", , )": 192,
    ", ) )": 183,
    ") ) {": 110,
    ") { if": 170,
    "{ if (": 1995,
    "( ) )": 7,
    "; break ;": 524,
    "break ; case": 861,
    "; } if": 565,
    "} if (": 2040,
    ", ) ;": 186,
    ") ; }": 134,
    "; } }": 567,
    "} } }": 2047,
    ", , }": 199,
    ") ; return": 131,
    "( , )": 20,
    "; } else": 564,
    "} else {": 2036,
    "( ) ;": 11,
    "( ) =": 12,
    ") = =": 138,
    "= = )": 622,
    "= ) {": 608,
    "; } return": 566,
    "std : :": 1719,
    ", . )": 202,
    ". ) ;": 332,
    ") { (": 169,
    ") , (": 113,
    ", ( )": 179,
    ") ) ,": 106,
    "( ) {": 16,
    ") ; >": 128,
    "; } ;": 563,
    "; ; ;": 512,
    "( = =": 34,
    ") ; =": 127,
    "if ( )": 1223,
    "( ) >": 13,
    ") ; ;": 126,
    ") { return": 171,
    "; = ;": 515,
    "apply": 796,
    "plugin": 1538,
    "com": 923,
    "android": 789,
    "application": 795,
    "test": 1765,
    "txt": 1830,
    "dependencies": 990,
    "jar": 1287,
    "dir": 1001,
    "core": 949,
    "path": 1528,
    "media": 1379,
    "com .": 925,
    ". }": 432,
    "false }": 1088,
    ": [": 463,
    "[ .": 698,
    ". jar": 392,
    ": .": 443,
    ". .": 338,
    ". core": 370,
    ") }": 174,
    ": . .": 445,
    "code": 917,
    "create": 955,
    "custom": 962,
    "no": 1435,
    "available": 815,
    "our": 1497,
    "user": 1866,
    "which": 1922,
    "web": 1912,
    "based": 832,
    "requires": 1605,
    "process": 1557,
    "here": 1184,
    "some": 1688,
    "how": 1190,
    "use": 1863,
    "url": 1858,
    "from": 1128,
    "card": 890,
    "data": 969,
    "between": 841,
    "these": 1785,
    "text": 1766,
    "input": 1254,
    "field": 1093,
    "want": 1907,
    "other": 1496,
    "type": 1831,
    "continue": 942,
    "button": 867,
    "provided": 1564,
    "has": 1174,
    "been": 836,
    "its": 1282,
    "interface": 1266,
    "high": 1186,
    "output": 1500,
    "clear": 911,
    "types": 1836,
    "we": 1911,
    "using": 1869,
    "into": 1268,
    "us": 1861,
    "all": 779,
    ", the": 298,
    ", which": 311,
    "can be": 888,
    ", text": 297,
    "based on": 833,
    "on the": 1479,
    "data .": 971,
    ". {": 431,
    "} {": 2042,
    "{ }": 2010,
    "core .": 950,
    ": a": 468,
    ". if": 387,
    "if you": 1226,
    ". com": 368,
    "] (": 721,
    ") .": 118,
    ". all": 364,
    "} { }": 2043,
    "do": 1014,
    "timestamp": 1799,
    "assert": 807,
    "ok": 1474,
    "os": 1495,
    "to a": 1806,
    ". (": 322,
    ", :": 205,
    ") end": 156,
    "end end": 1048,
    ". ( .": 325,
    ". ( )": 323,
    "package": 1514,
    "c": 872,
    "corporation": 951,
    "source": 1689,
    "binary": 843,
    "forms": 1123,
    "following": 1112,
    "condition": 931,
    "s": 1629,
    "may": 1375,
    "used": 1864,
    "non": 1437,
    "event": 1064,
    "special": 1698,
    "services": 1661,
    "whether": 1921,
    "contract": 943,
    "way": 1910,
    "out": 1498,
    "such": 1737,
    "define": 984,
    "ifdef": 1227,
    "endif": 1052,
    "api": 792,
    "register": 1593,
    "defined": 986,
    "offset": 1473,
    "value": 1879,
    "x": 1953,
    "( c": 44,
    "c )": 874,
    "that the": 1773,
    "the following": 1777,
    ", this": 299,
    "list of": 1341,
    "and the": 788,
    "used to": 1865,
    "to ,": 1804,
    ". in": 388,
    ", data": 237,
    "out of": 1499,
    "of this": 1471,
    "] ;": 734,
    "; <": 513,
    ": )": 438,
    ") [": 144,
    "] :": 733,
    ": (": 436,
    "define (": 985,
    "< <": 571,
    "< )": 569,
    ") <": 135,
    "( [": 36,
    "] )": 722,
    "value of": 1885,
    "( value": 88,
    "value )": 1880,
    ") (": 98,
    "( c )": 45,
    "= = =": 623,
    "[ ] ;": 707,
    ") [ ]": 145,
    "( [ ]": 38,
    "[ ] )": 704,
    ") ( (": 99,
    "( ( (": 2,
    ") ) )": 105,
    ") ) }": 111,
    "system": 1745,
    "io": 1269,
    "module": 1395,
    "sub": 1735,
    "main": 1361,
    "dim": 1000,
    "local": 1345,
    "string": 1726,
    "class": 909,
    "function": 1134,
    "split": 1700,
    "integer": 1264,
    "each": 1030,
    "line": 1334,
    "replace": 1600,
    "match": 1370,
    "next": 1431,
    "w": 1904,
    "length": 1317,
    "add": 771,
    "key": 1299,
    "values": 1886,
    "i": 1202,
    "count": 953,
    "section": 1646,
    "system .": 1746,
    ". io": 390,
    ". text": 417,
    "text .": 1767,
    "string )": 1727,
    ") as": 151,
    "string ,": 1728,
    "string .": 1729,
    "< >": 574,
    "end if": 1050,
    "s (": 1630,
    "( w": 92,
    "s .": 1634,
    ". length": 396,
    ". add": 362,
    "add (": 772,
    ", new": 273,
    "{ .": 1981,
    ". name": 399,
    "} )": 2018,
    "is a": 1272,
    "= [": 628,
    ". value": 424,
    "value .": 1882,
    "list (": 1339,
    "( i": 53,
    "i )": 1203,
    "section .": 1647,
    "> =": 685,
    "name )": 1417,
    ") then": 166,
    "write (": 1950,
    "end function": 1049,
    ". text .": 418,
    "( ) .": 9,
    ") ) .": 107,
    ". add (": 363,
    ") , .": 116,
    "] ) )": 723,
    "( i )": 54,
    "component": 930,
    "library": 1329,
    "org": 1492,
    "root": 1624,
    "files": 1099,
    "> <": 677,
    "org .": 1493,
    "url =": 1860,
    ". org": 402,
    ". . .": 342,
    "description": 992,
    "str": 1723,
    "https": 1199,
    "github": 1148,
    "http": 1196,
    "www": 1951,
    "html": 1193,
    "dev": 995,
    "apache": 791,
    "src": 1703,
    "java": 1288,
    "options": 1488,
    "target": 1759,
    ". :": 347,
    "https :": 1200,
    ": github": 474,
    "github .": 1149,
    "{ :": 1982,
    "http :": 1197,
    ": www": 497,
    "www .": 1952,
    ". html": 383,
    "} :": 2027,
    "[ [": 701,
    ". ]": 360,
    "] ]": 744,
    "] }": 748,
    "] [": 742,
    "https : github": 1201,
    ": github .": 475,
    "github . com": 1150,
    "http : www": 1198,
    ": www .": 498,
    "bin": 842,
    "set": 1663,
    "ex": 1065,
    "up": 1855,
    "when": 1919,
    "rf": 1621,
    "git": 1147,
    "container": 937,
    "was": 1909,
    "because": 835,
    "an": 784,
    "get": 1144,
    "update": 1856,
    "install": 1258,
    "y": 1963,
    "linux": 1337,
    "host": 1188,
    "cc": 897,
    "fi": 1092,
    "export": 1072,
    "t": 1747,
    "like": 1333,
    "old": 1476,
    "build": 864,
    "p": 1505,
    "usr": 1870,
    "done": 1020,
    "config": 932,
    "global": 1152,
    "email": 1042,
    "example": 1066,
    "state": 1711,
    "try": 1827,
    "ls": 1353,
    "exit": 1069,
    "external": 1076,
    "request": 1602,
    "z": 1974,
    "n": 1405,
    "make": 1363,
    "image": 1230,
    "f": 1077,
    "auto": 814,
    "o": 1460,
    "d": 963,
    "b": 816,
    "k": 1295,
    "pass": 1527,
    "common": 928,
    "token": 1810,
    "echo": 1031,
    "download": 1023,
    "lib": 1328,
    "= ]": 630,
    "i .": 1206,
    "( or": 72,
    "i =": 1209,
    "[ (": 694,
    ") ]": 146,
    "from the": 1129,
    "else if": 1038,
    "} ]": 2033,
    "[ {": 719,
    "} =": 2030,
    ": }": 502,
    "a )": 752,
    "= { }": 665,
    "{ } {": 2014,
    ": { }": 501,
    "unit": 1849,
    "windows": 1935,
    "controls": 945,
    "db": 977,
    "procedure": 1556,
    "private": 1554,
    "boolean": 851,
    "r": 1573,
    "var": 1888,
    "array": 803,
    "j": 1283,
    "low": 1351,
    "nil": 1432,
    "while": 1923,
    "result": 1612,
    "left": 1313,
    "width": 1928,
    "div": 1008,
    "format": 1122,
    "items": 1281,
    "enabled": 1045,
    "self": 1653,
    "exception": 1067,
    "now": 1447,
    "date": 973,
    "font": 1113,
    "style": 1733,
    ", {": 317,
    "} ,": 2021,
    "; :": 510,
    ": boolean": 469,
    "; end": 531,
    "end ;": 1047,
    "; function": 536,
    "; {": 559,
    "r .": 1576,
    "; var": 556,
    ": string": 491,
    "; i": 539,
    ": integer": 481,
    "; begin": 521,
    ": =": 460,
    ") do": 154,
    "[ j": 715,
    "= nil": 649,
    "i <": 1208,
    "length (": 1318,
    "begin {": 839,
    ", i": 248,
    "( j": 61,
    "j )": 1284,
    "value :": 1883,
    "result :": 1613,
    "= value": 663,
    "and (": 786,
    "[ i": 712,
    "i ]": 1211,
    "} end": 2037,
    "then begin": 1783,
    "= false": 637,
    "left :": 1314,
    "} [": 2032,
    "name ,": 1418,
    "> ,": 671,
    "= list": 645,
    "] <": 736,
    "> )": 670,
    "] .": 732,
    "( self": 77,
    "self )": 1654,
    "= true": 660,
    "text :": 1768,
    "; end ;": 532,
    ": = ;": 461,
    ") ; end": 129,
    "[ i ]": 713,
    "] ) ;": 726,
    "= false ;": 638,
    ", . ,": 203,
    "( self )": 78,
    "= true ;": 661,
    "author": 813,
    "street": 1725,
    "fill": 1100,
    "white": 1925,
    "black": 846,
    ". =": 354,
    "should be": 1673,
    ", x": 312,
    ", y": 314,
    "where": 1920,
    "import": 1235,
    "debug": 980,
    "one": 1480,
    "two": 1829,
    "three": 1794,
    "there": 1784,
    "total": 1815,
    "were": 1917,
    "note": 1445,
    "contains": 938,
    "int": 1260,
    "mod": 1392,
    "sum": 1739,
    "map": 1365,
    "print": 1553,
    "if the": 1225,
    ". for": 378,
    ". the": 420,
    ". >": 356,
    "> >": 686,
    "n n": 1413,
    "( n": 67,
    "n )": 1406,
    "n =": 1411,
    "( t": 82,
    "t )": 1749,
    "( if": 57,
    "o )": 1461,
    "[ ,": 695,
    "= n": 647,
    "t =": 1753,
    "h )": 1166,
    "( x": 93,
    "[ a": 711,
    "a .": 755,
    ". z": 430,
    "> > >": 687,
    "( n )": 68,
    "( t )": 83,
    "dt": 1024,
    "mm": 1390,
    "right": 1622,
    "g": 1138,
    "start": 1710,
    "run": 1627,
    "feature": 1090,
    "only": 1481,
    "load": 1343,
    "link": 1336,
    "current": 961,
    "v": 1872,
    "microsoft": 1385,
    "compile": 929,
    "command": 926,
    "language": 1308,
    "equivalent": 1058,
    "primary": 1552,
    "short": 1671,
    "duration": 1025,
    "small": 1683,
    "about": 766,
    "bytes": 871,
    "variable": 1890,
    "group": 1162,
    "well": 1916,
    "since": 1677,
    "same": 1637,
    "address": 774,
    "space": 1691,
    "also": 780,
    "entity": 1053,
    "resources": 1609,
    "long": 1349,
    "less": 1319,
    "cases": 895,
    "development": 996,
    "directory": 1002,
    "functions": 1137,
    "call": 883,
    "standard": 1709,
    "rs": 1626,
    "users": 1868,
    "reference": 1590,
    "their": 1780,
    "char": 903,
    "third": 1787,
    "argument": 801,
    "need": 1426,
    "status": 1715,
    "simple": 1676,
    "word": 1944,
    "first": 1105,
    "context": 941,
    "arg": 799,
    "en": 1044,
    "position": 1547,
    "important": 1236,
    "required": 1604,
    "method": 1383,
    "building": 865,
    "them": 1781,
    "final": 1102,
    "so": 1684,
    "just": 1294,
    "full": 1130,
    "find": 1103,
    "point": 1542,
    "form": 1121,
    "own": 1504,
    "br": 857,
    "names": 1423,
    "header": 1178,
    "m": 1355,
    "symbol": 1744,
    "headers": 1179,
    "perform": 1531,
    "none": 1438,
    "inline": 1253,
    "man": 1364,
    "page": 1518,
    "very": 1898,
    "major": 1362,
    "second": 1645,
    "arguments": 802,
    "li": 1325,
    "zero": 1975,
    "after": 775,
    "display": 1004,
    "within": 1941,
    "level": 1324,
    "warning": 1908,
    "check": 905,
    "rest": 1611,
    "single": 1678,
    "character": 904,
    "given": 1151,
    "num": 1456,
    "optional": 1487,
    "le": 1312,
    "returns": 1620,
    "index": 1246,
    "number": 1457,
    "storage": 1721,
    "called": 886,
    "before": 837,
    "through": 1795,
    "stack": 1708,
    "save": 1639,
    "delete": 989,
    "access": 767,
    "active": 769,
    "prefix": 1551,
    "object": 1466,
    "table": 1756,
    "pointer": 1543,
    "handle": 1173,
    "operation": 1485,
    "assign": 808,
    "region": 1592,
    "attributes": 812,
    "node": 1436,
    "instance": 1259,
    "bit": 844,
    "double": 1021,
    "convert": 946,
    "parse": 1525,
    "tree": 1821,
    "area": 798,
    "fun": 1131,
    "specified": 1699,
    "q": 1570,
    "stream": 1724,
    "settings": 1668,
    "c .": 876,
    "n .": 1408,
    "g .": 1140,
    "d (": 964,
    ", is": 257,
    "is the": 1274,
    "the current": 1775,
    ". and": 365,
    ", and": 226,
    ". p": 403,
    "as a": 805,
    "on a": 1478,
    "the same": 1779,
    ", a": 223,
    "of a": 1469,
    ". it": 391,
    ", in": 252,
    "f .": 1081,
    ". i": 385,
    "it is": 1278,
    "in .": 1239,
    "( int": 60,
    ", you": 316,
    "value ,": 1881,
    "file .": 1096,
    ". c": 367,
    "int (": 1261,
    "return (": 1617,
    "to be": 1807,
    ". o": 401,
    ", if": 251,
    "with the": 1940,
    "in a": 1240,
    ", it": 258,
    "for the": 1119,
    "the first": 1776,
    "it ,": 1276,
    "must be": 1402,
    ". b": 366,
    "c (": 873,
    "w .": 1906,
    "m .": 1358,
    "c ,": 875,
    ", <": 212,
    "< string": 596,
    "p .": 1509,
    "function (": 1135,
    ". a": 361,
    "a new": 764,
    "at the": 810,
    ": if": 480,
    "is not": 1273,
    "a :": 756,
    "( and": 42,
    "number of": 1459,
    "call (": 884,
    "while (": 1924,
    "f :": 1082,
    "in ,": 1238,
    "for this": 1120,
    "[ ] ,": 705,
    ", . .": 204,
    ". , .": 336,
    "function ( )": 1136,
    "( ( )": 3,
    "content": 939,
    "res": 1606,
    "configuration": 934,
    "app": 793,
    "util": 1871,
    "log": 1348,
    "view": 1900,
    "widget": 1927,
    "null": 1451,
    "val": 1877,
    "layout": 1311,
    "window": 1934,
    "id": 1213,
    "params": 1523,
    "size": 1679,
    "height": 1180,
    "bottom": 854,
    "show": 1674,
    "= null": 651,
    ") var": 167,
    "int =": 1263,
    "( r": 74,
    "= this": 658,
    "this .": 1790,
    "( this": 85,
    ". id": 386,
    ", null": 277,
    "null )": 1452,
    ") if": 159,
    "= if": 644,
    "r =": 1577,
    "r )": 1574,
    "{ var": 2006,
    ". get": 380,
    "get (": 1145,
    "true }": 1826,
    "height :": 1181,
    "int )": 1262,
    "this ,": 1789,
    "= this .": 659,
    ". , )": 334,
    ", ) .": 185,
    ", null )": 278,
    "( , (": 19,
    "( ) if": 15,
    "( ) }": 17,
    "( ) :": 10,
    "} } )": 2045,
    ") if (": 160,
    ". ) .": 331,
    ") } }": 176,
    "xml": 1961,
    "property": 1563,
    "properties": 1562,
    "init": 1251,
    "version =": 1896,
    "value =": 1884,
    ". xml": 427,
    "} .": 2026,
    "} >": 2031,
    "version = .": 1897,
    ". > <": 357,
    "= . .": 614,
    ". , ,": 335,
    "body": 849,
    "color": 919,
    "background": 826,
    "fff": 1091,
    "focus": 1111,
    "hover": 1189,
    "img": 1233,
    "align": 777,
    "border": 852,
    "solid": 1686,
    "top": 1812,
    "mark": 1368,
    "success": 1736,
    "info": 1249,
    "transparent": 1820,
    "original": 1494,
    "title": 1800,
    "pre": 1550,
    "tr": 1816,
    "td": 1761,
    "th": 1770,
    "max": 1373,
    "control": 944,
    "disabled": 1003,
    "label": 1306,
    "help": 1183,
    "block": 847,
    "webkit": 1913,
    "box": 856,
    "shadow": 1669,
    "open": 1484,
    "toggle": 1809,
    "menu": 1381,
    "margin": 1366,
    "hidden": 1185,
    "nav": 1424,
    "min": 1387,
    "icon": 1212,
    "bar": 830,
    "span": 1692,
    "href": 1191,
    "item": 1280,
    "close": 914,
    "linear": 1335,
    "panel": 1519,
    "padding": 1515,
    "action": 768,
    "red": 1588,
    "green": 1160,
    "child": 906,
    "select": 1651,
    "search": 1644,
    "transition": 1819,
    "tab": 1755,
    "both": 853,
    "google": 1157,
    "last": 1310,
    "desc": 991,
    "me": 1377,
    "light": 1332,
    "css": 959,
    "off": 1472,
    "comment": 927,
    "{ color": 1989,
    "color :": 920,
    ": ;": 455,
    "; background": 519,
    "background color": 828,
    "align :": 778,
    "{ background": 1986,
    "; border": 522,
    ": solid": 490,
    "{ border": 1987,
    "top :": 1813,
    "bottom :": 855,
    "] {": 747,
    "right :": 1623,
    ". table": 416,
    "tr >": 1817,
    "type (": 1832,
    "> .": 673,
    "width :": 1929,
    ": none": 483,
    "none ;": 1440,
    "image :": 1231,
    "; text": 551,
    "; margin": 544,
    "margin :": 1367,
    "li >": 1326,
    "> a": 690,
    "a ,": 753,
    "] >": 741,
    "input [": 1255,
    "[ type": 718,
    "type =": 1835,
    ", [": 217,
    "a >": 759,
    "background :": 827,
    "not (": 1443,
    ", ;": 211,
    "{ padding": 2000,
    "padding :": 1516,
    "{ display": 1991,
    "display :": 1005,
    "content :": 940,
    "me .": 1378,
    "> {": 692,
    "{ margin": 1996,
    "{ color :": 1990,
    "color : ;": 921,
    "; background color": 520,
    "background color :": 829,
    "( , ,": 21,
    ". ) ,": 330,
    ": ; border": 456,
    ": none ;": 484,
    "height : ;": 1182,
    ": ; margin": 457,
    "] , [": 731,
    "( . ,": 27,
    "width : ;": 1930,
    "padding : ;": 1517,
    "{ display :": 1992,
    ": } }": 504,
    ": ) ,": 439,
    "e": 1026,
    "rate": 1582,
    "per": 1530,
    "fields": 1094,
    "vector": 1891,
    "filter": 1101,
    "order": 1491,
    "flag": 1106,
    "parameters": 1522,
    "face": 1083,
    "mode": 1393,
    "graph": 1159,
    "they": 1786,
    "could": 952,
    ", r": 286,
    "r ,": 1575,
    ", e": 238,
    "[ :": 699,
    ": ]": 466,
    ". ;": 350,
    ": the": 493,
    "it s": 1279,
    ": function": 473,
    ". n": 398,
    ": n": 482,
    ", as": 227,
    "m )": 1356,
    ", n": 268,
    "return ;": 1618,
    "( :": 29,
    "= :": 616,
    "= . ,": 613,
    ". . )": 340,
    ", r ,": 287,
    ". . ;": 344,
    ") ) =": 109,
    "( : )": 30,
    "= : :": 617,
    ") ) (": 104,
    ") = (": 137,
    "} ) ;": 2020,
    "= ( )": 605,
    "days": 976,
    "am": 782,
    "pm": 1540,
    "de": 979,
    "dd": 978,
    "ss": 1706,
    "l": 1302,
    "md": 1376,
    "ms": 1399,
    "day": 975,
    "year": 1969,
    "version :": 1894,
    "j ,": 1285,
    "f ,": 1080,
    "m ,": 1357,
    "s ,": 1633,
    "o ,": 1462,
    "n ,": 1407,
    ": d": 470,
    "d ,": 966,
    ": t": 492,
    "t ,": 1750,
    "q ,": 1571,
    ": p": 487,
    "e .": 1029,
    "d .": 967,
    ", d": 235,
    "y ,": 1966,
    "e ,": 1028,
    ", h": 247,
    "h :": 1169,
    "g ,": 1139,
    "v ,": 1874,
    ", m": 264,
    "m :": 1359,
    "l ,": 1303,
    "y :": 1967,
    "} (": 2017,
    "( {": 96,
    "{ a": 1985,
    ": { :": 500,
    ": , :": 442,
    ": } ,": 503,
    ", : ,": 206,
    "} } ,": 2046,
    ", : .": 207,
    ". , :": 337,
    ". } ,": 433,
    ". } }": 434,
    "{ } ,": 2012,
    "} , {": 2024,
    ", d ,": 236,
    "{ } )": 2011,
    "} ) ,": 2019,
    "{ } }": 2015,
    "raw": 1583,
    "doc": 1015,
    "pub": 1565,
    "bits": 845,
    "fn": 1109,
    "static": 1714,
    "let": 1320,
    "args": 800,
    "env": 1055,
    "expect": 1070,
    "family": 1089,
    "json": 1292,
    "different": 999,
    "len": 1316,
    "mut": 1403,
    "size (": 1680,
    "( in": 59,
    "with a": 1939,
    ". type": 422,
    "fn (": 1110,
    "string >": 1730,
    "; let": 543,
    "let =": 1323,
    ": <": 459,
    "> (": 668,
    "= >": 624,
    ". json": 394,
    "( data": 48,
    "; for": 534,
    ". data": 374,
    "data )": 970,
    "let (": 1321,
    "; .": 509,
    ", ) >": 188,
    "< string >": 597,
    "> ( )": 669,
    ": : ,": 450,
    ", } ,": 320,
    ", = >": 215,
    ": : :": 452,
    ") . (": 119,
    ", ) =": 187,
    ": : (": 448,
    "schema": 1641,
    "column": 922,
    "throw": 1796,
    "{ [": 1984,
    "user =": 1867,
    "= user": 662,
    "= null )": 652,
    "cache": 882,
    "product": 1558,
    "png": 1541,
    "report": 1601,
    "design": 993,
    "ui": 1840,
    "net": 1427,
    "keys": 1300,
    "expression": 1074,
    "cs": 958,
    "lt": 1354,
    "gt": 1163,
    "change": 902,
    "document": 1016,
    "store": 1722,
    "client": 912,
    "grid": 1161,
    "over": 1501,
    "se": 1643,
    "= http": 641,
    ". png": 406,
    "size =": 1682,
    "[ t": 717,
    "microsoft .": 1386,
    ". net": 400,
    ". <": 352,
    "set of": 1666,
    "html >": 1195,
    "html ,": 1194,
    "windows .": 1936,
    "{ } .": 2013,
    "= http :": 642,
    "= > <": 626,
    ". data .": 375,
    "name = >": 1421,
    ". . ,": 341,
    "> < >": 678,
    "< > <": 575,
    "na": 1415,
    "al": 776,
    "ca": 881,
    "co": 916,
    "world": 1947,
    "st": 1707,
    "center": 900,
    "la": 1305,
    "service": 1660,
    "range": 1581,
    "closed": 915,
    "lower": 1352,
    "ne": 1425,
    "home": 1187,
    "strong": 1731,
    "yes": 1970,
    "cross": 957,
    "post": 1549,
    "circle": 908,
    "port": 1545,
    "blue": 848,
    "del": 988,
    "fire": 1104,
    "care": 891,
    "ii": 1229,
    "university": 1851,
    "don": 1018,
    "security": 1648,
    "square": 1702,
    "el": 1035,
    "children": 907,
    "response": 1610,
    "union": 1848,
    "es": 1061,
    "lock": 1347,
    "re": 1584,
    "unknown": 1852,
    "too": 1811,
    "head": 1177,
    "reg": 1591,
    "flags": 1107,
    "stop": 1720,
    "edge": 1032,
    "sp": 1690,
    "put": 1569,
    "production": 1559,
    "points": 1544,
    "large": 1309,
    "row": 1625,
    "edu": 1033,
    "em": 1041,
    "frame": 1126,
    "lang": 1307,
    "back": 825,
    "cat": 896,
    "pl": 1535,
    "ch": 901,
    "cd": 898,
    "had": 1171,
    "loop": 1350,
    "asm": 806,
    "php": 1533,
    "car": 889,
    "ab": 765,
    "nl": 1434,
    "ns": 1450,
    "float": 1108,
    "parent": 1524,
    "methods": 1384,
    "task": 1760,
    "ul": 1842,
    "ll": 1342,
    "tmp": 1802,
    "js": 1291,
    "down": 1022,
    "col": 918,
    "tag": 1757,
    "ext": 1075,
    "op": 1482,
    "ie": 1219,
    "dl": 1013,
    "ret": 1615,
    "et": 1062,
    "die": 998,
    "ref": 1589,
    "eq": 1056,
    "my": 1404,
    "err": 1059,
    "hash": 1175,
    "normal": 1441,
    "ts": 1828,
    "real": 1586,
    "buf": 862,
    "csv": 960,
    "model": 1394,
    "mob": 1391,
    "sep": 1658,
    "work": 1945,
    "sql": 1701,
    "units": 1850,
    "person": 1532,
    "read": 1585,
    "temp": 1763,
    "tgz": 1769,
    "un": 1844,
    "who": 1926,
    "def": 981,
    "won": 1943,
    "states": 1713,
    "goto": 1158,
    "pos": 1546,
    "pi": 1534,
    "sign": 1675,
    "record": 1587,
    "uri": 1857,
    "loc": 1344,
    "id ,": 1215,
    ", type": 304,
    "type ,": 1833,
    ", name": 271,
    ", no": 274,
    "j .": 1286,
    ", l": 263,
    ", o": 280,
    "ok ,": 1475,
    ", s": 289,
    ", state": 294,
    ", w": 309,
    ", j": 259,
    "h .": 1168,
    ", b": 228,
    "b .": 820,
    ", g": 246,
    "t .": 1751,
    "over the": 1502,
    ", f": 240,
    "l .": 1304,
    ", c": 233,
    ", p": 283,
    "h ,": 1167,
    "o .": 1463,
    ", k": 261,
    "number ,": 1458,
    ". r": 407,
    ", false": 242,
    "com ,": 924,
    ", u": 305,
    ", v": 307,
    "v .": 1875,
    ". s": 408,
    ". g": 379,
    ", t": 295,
    ", q": 285,
    ", true": 302,
    ". t": 415,
    "c c": 880,
    "u .": 1839,
    ", all": 225,
    "is ,": 1271,
    "u ,": 1838,
    "b ,": 819,
    "x ,": 1956,
    "w ,": 1905,
    "p ,": 1508,
    "k ,": 1297,
    ". php": 405,
    "i ,": 1204,
    "id =": 1217,
    "( e": 50,
    "( d": 47,
    ". d": 373,
    "d )": 965,
    "p )": 1507,
    ". l": 395,
    "a =": 758,
    "and ,": 787,
    ", main": 267,
    "= d": 634,
    "= m": 646,
    "= p": 653,
    "p =": 1511,
    ", out": 282,
    "= c": 633,
    "c =": 878,
    ", so": 293,
    "( m": 66,
    ", id": 250,
    "it .": 1277,
    "d =": 968,
    ", err": 239,
    ", int": 256,
    "state .": 1712,
    ", set": 292,
    ", to": 301,
    "title =": 1801,
    "v =": 1876,
    ". com ,": 369,
    ". s .": 409,
    "= , ,": 610,
    ", , [": 197,
    ", , (": 191,
    ", n ,": 270,
    ", k ,": 262,
    ", a ,": 224,
    "( a )": 40,
    ") . .": 120,
    ", c ,": 234,
    ", i ,": 249,
    ", s ,": 290,
    ", x ,": 313,
    "attribute": 811,
    "distance": 1006,
    "cell": 899,
    "sample": 1638,
    "server": 1659,
    "transform": 1818,
    "scale": 1640,
    "minor": 1388,
    "gets": 1146,
    "database": 972,
    "clock": 913,
    "{ name": 1998,
    "style =": 1734,
    "width =": 1931,
    ". section": 410,
    "end {": 1051,
    "a (": 751,
    ") in": 161,
    "( s": 75,
    "s =": 1636,
    "{ c": 1988,
    "index )": 1247,
    "( v": 87,
    "e )": 1027,
    "= a": 631,
    "t (": 1748,
    "n }": 1414,
    "s :": 1635,
    "k =": 1298,
    "= e": 635,
    "( k": 62,
    "k )": 1296,
    "x .": 1958,
    "v )": 1873,
    "( l": 63,
    "{ n": 1997,
    "= s": 655,
    "b =": 823,
    "b )": 818,
    ") endif": 157,
    ". [": 358,
    "y )": 1965,
    "[ , ,": 696,
    "[ ] [": 709,
    ") } ,": 175,
    "( . )": 26,
    "{ , }": 1980,
    ", ) ]": 189,
    ", ) ,": 184,
    ", ) (": 182,
    "i , j": 1205,
    ": [ {": 465,
    ", : [": 209,
    "a , b": 754,
    "( a ,": 41,
    ", b )": 229,
    "( n ,": 69,
    "x , y": 1957,
    "( i ,": 55,
    "ignore": 1228,
    "> [": 688,
    "i ;": 1207,
    "] , )": 728,
    ") = >": 139,
    "found": 1124,
    "than": 1771,
    "more than": 1397,
    "] [ ]": 743,
    "insert": 1256,
    ", ]": 220,
    "null ;": 1455,
    "( , [": 23,
    ", ] )": 221,
    ": ; }": 458,
    "; } .": 562,
    "datum": 974,
    "generic": 1143,
    "being": 840,
    "does": 1017,
    "unless": 1853,
    "hand": 1172,
    "proc": 1555,
    "valid": 1878,
    "never": 1428,
    "obj": 1464,
    "reset": 1607,
    "repeat": 1599,
    "remove": 1598,
    "var =": 1889,
    "true ,": 1824,
    "( var": 89,
    "null ,": 1454,
    ") for": 158,
    ", we": 310,
    "case .": 893,
    "obj item": 1465,
    "= i": 643,
    "( src": 80,
    "src =": 1705,
    "( name": 70,
    "< span": 593,
    "span class": 1695,
    "class =": 910,
    "span >": 1693,
    "( not": 71,
    "= <": 620,
    "( f": 52,
    "< br": 581,
    "br >": 858,
    "< i": 588,
    "i >": 1210,
    "don t": 1019,
    ") else": 155,
    "= r": 654,
    ". . (": 339,
    "( ) (": 6,
    ") ( )": 100,
    "if ( (": 1222,
    ". ) )": 329,
    "< span class": 595,
    "span class =": 1696,
    "< span >": 594,
    "< br >": 582,
    "> < br": 680,
    "span > <": 1694,
    "] = =": 739,
    "intent": 1265,
    "solution": 1687,
    "matrix": 1372,
    "parameter": 1521,
    "b (": 817,
    "x =": 1960,
    "( b": 43,
    "< :": 570,
    "; n": 546,
    "n ;": 1410,
    "n >": 1412,
    ", b ,": 230,
    ") : :": 123,
    "( : ,": 31,
    "else if (": 1039,
    "name :": 1419,
    ": [ ]": 464,
    "resource": 1608,
    "callback": 885,
    "nothing": 1446,
    ": >": 462,
    ". eq": 377,
    "( . .": 28,
    ". core .": 371,
    ". . }": 346,
    "exists": 1068,
    "connection": 935,
    "param": 1520,
    "missing": 1389,
    "require": 1603,
    "random": 1580,
    "func": 1132,
    "msg": 1400,
    "; the": 552,
    "s )": 1631,
    ", index": 255,
    "; (": 506,
    "( void": 90,
    "void )": 1903,
    "status ,": 1716,
    ". version": 425,
    "id )": 1214,
    "; [": 517,
    "( >": 35,
    "{ type": 2005,
    "false )": 1085,
    ": return": 489,
    "; ,": 508,
    "c >": 879,
    "{ {": 2009,
    "false ,": 1086,
    "func (": 1133,
    ": null": 485,
    ", value": 308,
    "( s )": 76,
    ") ( ,": 101,
    "return ; }": 1619,
    ") , )": 114,
    "( void )": 91,
    "; for (": 535,
    ") ; (": 125,
    "; ( )": 507,
    "] = ;": 738,
    "null ) ;": 1453,
    "= ( (": 604,
    "= ( ,": 606,
    ", null ,": 279,
    "( e )": 51,
    ", false ,": 243,
    ", { ,": 318,
    ", true ,": 303,
    "} , }": 2025,
    "h include": 1170,
    ". h include": 382,
    ": ( )": 437,
    "= ; =": 619,
    "equal": 1057,
    "; use": 555,
    "this >": 1791,
    ") { this": 172,
    "; import": 542,
    "( string": 81,
    "results": 1614,
    "summary": 1740,
    "created": 956,
    "maximum": 1374,
    "query": 1572,
    "images": 1232,
    "< head": 587,
    "href =": 1192,
    ". js": 393,
    "< div": 584,
    "div >": 1009,
    "td >": 1762,
    "< ul": 600,
    "< li": 589,
    "< a": 576,
    "a href": 762,
    "ul >": 1843,
    "div class": 1011,
    "summary >": 1741,
    "> the": 691,
    "< b": 579,
    "b >": 824,
    "< p": 591,
    "p >": 1512,
    "} <": 2029,
    "; } )": 561,
    "> < div": 681,
    ": . ;": 446,
    "< div >": 585,
    "div > <": 1010,
    "> < li": 682,
    "< li >": 590,
    "li > <": 1327,
    "> < a": 679,
    "< a href": 578,
    "a href =": 763,
    ". html >": 384,
    "> < span": 684,
    "< a >": 577,
    "a > <": 760,
    ") > <": 142,
    "< ul >": 601,
    "< div class": 586,
    "div class =": 1012,
    "> . <": 674,
    "< b >": 580,
    "< p >": 592,
    "p > <": 1513,
    "> < p": 683,
    ". < p": 353,
    "registry": 1595,
    "license .": 1331,
    "config .": 933,
    "registry .": 1596,
    "set =": 1665,
    "( id": 56,
    "insert into": 1257,
    "x )": 1955,
    ". x": 426,
    ". ( ,": 324,
    "( , .": 22,
    "wire": 1937,
    "device": 997,
    "working": 1946,
    "always": 781,
    "runtime": 1628,
    "amount": 783,
    "people": 1529,
    "src .": 1704,
    ") set": 165,
    ". src": 413,
    ". loc": 397,
    ") c": 152,
    ". = .": 355,
    "( t ,": 84,
    "= [ ]": 629,
    "> , <": 672,
    "( ) ]": 14,
    ". ( [": 326,
    ") ] )": 147,
    "template": 1764,
    "mask": 1369,
    "values (": 1887,
    "filename": 1097,
    "filename =": 1098,
    "shift": 1670,
    "join": 1290,
    "push": 1568,
    "spec": 1697,
    "buffer": 863,
    "element": 1036,
    "; my": 545,
    "= t": 657,
    "t ]": 1754,
    "> ]": 689,
    "b ;": 822,
    "= > ,": 625,
    "[ ] }": 710,
    ", [ ]": 219,
    "] ) .": 725,
    ", , ;": 196,
    ") : (": 122,
    "] ) ,": 724,
    "] ; }": 735,
    "( [ ,": 37,
    "[ , ]": 697,
    ", ] ,": 222,
    "] , ,": 729,
    "; self": 550,
    "impl": 1234,
    "pub fn": 1566,
    "unsigned": 1854,
    "byte": 870,
    ": false": 471,
    "list .": 1340,
    "p :": 1510,
    "type :": 1834,
    "id :": 1216,
    "} , :": 2023,
    ": false ,": 472,
    ") , :": 117,
    ", : :": 208,
    ") > (": 141,
    ", , ]": 198,
    "internal": 1267,
    "undefined": 1845,
    "p (": 1506,
    "global .": 1153,
    ". size": 412,
    "( ( .": 4,
    "url :": 1859,
    ": http": 476,
    ": http :": 477,
    "opacity": 1483,
    ") p": 162,
    "f )": 1079,
    "( p": 73,
    "append": 794,
    ". param": 404,
    "= function": 639,
    "= function (": 640,
    "( x )": 94,
    "] ] )": 745,
    ": : )": 449,
    "; this": 553,
    ". . =": 345,
    "def (": 982,
    "registered": 1594,
    "; no": 547,
    "{ self": 2002,
    "= self": 656,
    ") ( .": 102,
    ". [ ]": 359,
    ". : :": 349,
    ": true": 494,
    "math": 1371,
    "move": 1398,
    "weight": 1914,
    "} function": 2038,
    ", url": 306,
    "y =": 1968,
    "time ,": 1798,
    "x :": 1959,
    "a [": 761,
    "index :": 1248,
    "; width": 557,
    "; height": 537,
    "position :": 1548,
    "a ;": 757,
    "= none": 650,
    "font size": 1114,
    "size :": 1681,
    "; font": 533,
    "weight :": 1915,
    "; color": 527,
    "; padding": 548,
    ", none": 275,
    ": type": 496,
    ", function": 244,
    "none ,": 1439,
    ") ; var": 133,
    ") { var": 173,
    "[ ] .": 706,
    ", y ,": 315,
    ", m ,": 265,
    ": : ;": 453,
    ": true ,": 495,
    "; width :": 558,
    "; height :": 538,
    "left : ;": 1315,
    "top : ;": 1814,
    ") ; this": 132,
    "; this .": 554,
    "font size :": 1115,
    "; color :": 528,
    "( this .": 86,
    "{ this .": 2004,
    ", function (": 245,
    ", this .": 300,
    "tags": 1758,
    "set (": 1664,
    "n :": 1409,
    "self ,": 1655,
    "self .": 1656,
    ". ) (": 328,
    "( x ,": 95,
    ", name :": 272,
    "( self ,": 79,
    "[ : ]": 700,
    ". y": 428,
    "x (": 1954,
    ", n )": 269,
    "regular": 1597,
    ": : {": 454,
    "[ ] (": 703,
    ". ; ;": 351,
    ": ] ;": 467,
    "b :": 821,
    "; c": 525,
    "( . (": 25,
    "{ width": 2007,
    "= > {": 627,
    "session": 1662,
    "] , :": 730,
    "expr": 1073,
    "= f": 636,
    "nil )": 1433,
    "; a": 518,
    ", not": 276,
    ", [ ,": 218,
    ", ( ,": 180,
    ", , :": 195,
    "c :": 877,
    "t :": 1752,
    "= . =": 615,
    ") > {": 143,
    ") ] [": 149,
    ") ] ,": 148,
    "f (": 1078,
    "y (": 1964,
    "id ]": 1218,
    "name >": 1422,
    ", self": 291,
    "[ id": 714,
    ", body": 231,
    ": . ,": 444,
    "init (": 1252,
    ". init": 389,
    "< c": 583,
    ". . :": 343,
    "defun": 987,
    "selected": 1652,
    "member": 1380,
    "actual": 770,
    "sets": 1667,
    "( defun": 49,
    "( let": 64,
    "to :": 1805,
    "version : .": 1895,
    "( let (": 65,
    "let ( (": 1322,
    "( if (": 58,
    "= and": 632,
    "radius": 1578,
    "radius :": 1579,
    "{ width :": 2008,
    ": https": 478,
    ": https :": 479,
    "json .": 1293,
    ". string": 414,
    "video": 1899,
    "xs": 1962,
    "} , ,": 2022,
    "cpp": 954,
    ". cpp": 372,
    "not null": 1444,
    "java .": 1289,
    "{ id": 1993,
    "< summary": 598,
    "< summary >": 599,
    "[ k": 716,
    ", j ,": 260,
    ", : {": 210,
    "] } ,": 749,
    "of ,": 1468,
    ", result": 288,
    ", p ,": 284,
    "s ) ,": 1632,
    ", t ,": 296,
    ", . (": 201,
    "< = ;": 573,
    ". ui": 423,
    "ui .": 1841,
    "] ] ,": 746,
    "{ name :": 1999,
    "} ] ,": 2034,
    ") self": 164,
    ") call": 153,
    "npmjs": 1448,
    ": registry": 488,
    "npmjs .": 1449,
    ". tgz": 419,
    ": null ,": 486,
    "h (": 1165,
    ": : .": 451,
    ". : .": 348,
    ", f ,": 241,
    "plugins": 1539
}